import React from 'react';

export default function RulesPage() {
  return (
    <article className="about-container">
      <h2>Условия пользования</h2>
      <ol>
        <li>
          <strong>Общие положения</strong>
          <ol>
            <li>
              <strong>Описание сайта</strong>
              <p>
                React Pizza (далее `сайт`) предоставляет пользователям
                возможность заказывать пиццу и другие продукты питания через
                интернет.
              </p>
            </li>
            <li>
              <strong>Согласие с условиями</strong>
              <p>
                Используя наш сайт, вы подтверждаете, что ознакомлены и согласны
                с настоящими условиями пользования.
              </p>
            </li>
            <li>
              <strong>Изменения условий</strong>
              <p>
                Мы оставляем за собой право в любое время изменять условия
                пользования. Новая редакция вступает в силу с момента её
                публикации на сайте.
              </p>
            </li>
          </ol>
        </li>
        <li>
          <strong>Использование сайта</strong>
          <ol>
            <li>
              <strong>Правила поведения</strong>
              <p>
                Вы обязуетесь использовать сайт в соответствии с действующим
                законодательством и настоящими условиями. Запрещено:
              </p>
              <ul>
                <li>Распространять ложную информацию.</li>
                <li>Загружать вирусы или другие вредоносные программы.</li>
                <li>
                  Использовать сайт для коммерческой рекламы без нашего
                  разрешения.
                </li>
              </ul>
            </li>
            <li>
              <strong>Регистрация</strong>
              <p>
                Для использования некоторых функций сайта может потребоваться
                регистрация. При регистрации вы обязуетесь предоставлять только
                точную и актуальную информацию.
              </p>
            </li>
            <li>
              <strong>Конфиденциальность учетных данных</strong>
              <p>
                Вы несете ответственность за конфиденциальность своих учетных
                данных и обязуетесь незамедлительно уведомить нас о любом
                несанкционированном использовании вашего аккаунта.
              </p>
            </li>
          </ol>
        </li>
        <li>
          <strong>Защита персональных данных</strong>
          <ol>
            <li>
              <strong>Сбор и использование данных</strong>
              <p>
                Мы собираем и используем ваши персональные данные в соответствии
                с нашей Политикой конфиденциальности.
              </p>
            </li>
            <li>
              <strong>Передача данных третьим лицам</strong>
              <p>
                Мы не передаем ваши персональные данные третьим лицам без вашего
                согласия, за исключением случаев, предусмотренных законом.
              </p>
            </li>
            <li>
              <strong>Безопасность данных</strong>
              <p>
                Мы принимаем все необходимые меры для защиты ваших данных от
                несанкционированного доступа, изменения или уничтожения.
              </p>
            </li>
          </ol>
        </li>
        <li>
          <strong>Права и обязанности сторон</strong>
          <ol>
            <li>
              <strong>Наши права</strong>
              Мы оставляем за собой право:
              <ul>
                <li>Изменять содержание сайта.</li>
                <li>
                  Ограничивать или прекращать доступ к сайту без
                  предварительного уведомления.
                </li>
              </ul>
            </li>
            <li>
              <strong>Ваши обязанности</strong>
              Вы обязуетесь:
              <ul>
                <li>Соблюдать настоящие условия пользования.</li>
                <li>
                  Предоставлять только достоверную информацию при регистрации и
                  заказе.
                </li>
              </ul>
            </li>
          </ol>
        </li>
        <li>
          <strong>Ответственность</strong>
          <ol>
            <li>
              <strong>Ограничение ответственности</strong>
              <p>React Pizza не несет ответственности за:</p>
              <ul>
                <li>
                  Убытки, возникшие в результате использования или невозможности
                  использования сайта.
                </li>
                <li>Ошибки или сбои в работе сайта.</li>
              </ul>
            </li>
            <li>
              <strong>Гарантии</strong>
              <p>
                Мы не гарантируем бесперебойную и безошибочную работу сайта.
              </p>
            </li>
          </ol>
        </li>
        <li>
          <strong>Заключительные положения</strong>
          <ol>
            <li>
              <strong>Применимое право</strong>
              <p>
                Настоящие условия регулируются законодательством Республики
                Беларусь.
              </p>
            </li>
            <li>
              <strong>Разрешение споров</strong>
              <p>
                Все споры, возникающие в связи с использованием сайта, подлежат
                разрешению в соответствии с действующим законодательством.
              </p>
            </li>
            <li>
              <strong>Связь с нами</strong>
              <p>
                Если у вас есть вопросы или предложения, вы можете связаться с
                нами по телефону: 2025 или по электронной почте:
                react-pizza@gmail.com.
              </p>
            </li>
          </ol>
        </li>
      </ol>
    </article>
  );
}
